tutorials/compressible/rhoSimpleFoam/gasMixing/injectorPipe/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet_air
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.095;
        value           uniform (0 0 0);
    }

    inlet_fuel
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.005;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      (0 0 0);
        value           $internalField;
    }

    "wall.*"
    {
        type            noSlip;
    }

    ".*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
